### 데이터
* data : 한국가스공사 시간별 공급량 데이터
* gn : 강릉 시간별 기상 데이터
* parse_dates=['구매일']

In [1]:
import pandas as pd

In [186]:
print("2013-01-01 ~ 2018-12-31 총 길이 : {}".format(len(pd.date_range(start = "2013-01-01 00:00:00", 
                                                                    end = "2018-12-31 23:00:00", freq = "1h"))))
for i in range(2013, 2019) :
    print("{}년 길이 : {}".format(i, len(pd.date_range(start = f"{i}-01-01 00:00:00", 
                                                    end = f"{i}-12-31 23:00:00", freq = "1h"))))

2013-01-01 ~ 2018-12-31 총 길이 : 52584
2013년 길이 : 8760
2014년 길이 : 8760
2015년 길이 : 8760
2016년 길이 : 8784
2017년 길이 : 8760
2018년 길이 : 8760

In [53]:
pd.set_option("display.max_columns", None)

### 가스공급량 데이터

In [165]:
data = pd.read_csv("../CSV/한국가스공사_시간별_공급량_20181231.csv", encoding = 'cp949')

In [166]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 368088 entries, 0 to 368087
Data columns (total 4 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   연월일     368088 non-null  object
 1   시간      368088 non-null  int64
 2   구분      368088 non-null  object
 3   공급량     368088 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 11.2+ MB

In [167]:
data.head(3)

          연월일  시간 구분       공급량
0  2013-01-01   1  A  2497.129
1  2013-01-01   2  A  2363.265
2  2013-01-01   3  A  2258.505

In [168]:
data.groupby(["연월일", "구분"]).count()

               시간  공급량
연월일        구분
2013-01-01 A   24   24
           B   24   24
           C   24   24
           D   24   24
           E   24   24
...            ..  ...
2018-12-31 C   24   24
           D   24   24
           E   24   24
           G   24   24
           H   24   24

[15337 rows x 2 columns]

In [169]:
data.groupby(["구분"]).count()

      연월일     시간    공급량
구분
A   52584  52584  52584
B   52584  52584  52584
C   52584  52584  52584
D   52584  52584  52584
E   52584  52584  52584
G   52584  52584  52584
H   52584  52584  52584

In [170]:
data["구분"].unique()

array(['A', 'B', 'C', 'D', 'E', 'G', 'H'], dtype=object)

### 가스공급량 데이터 날짜 데이터 타입 변경

In [171]:
data.head(3)

          연월일  시간 구분       공급량
0  2013-01-01   1  A  2497.129
1  2013-01-01   2  A  2363.265
2  2013-01-01   3  A  2258.505

In [172]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 368088 entries, 0 to 368087
Data columns (total 4 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   연월일     368088 non-null  object
 1   시간      368088 non-null  int64
 2   구분      368088 non-null  object
 3   공급량     368088 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 11.2+ MB

In [173]:
data["일시"] = data["연월일"] + " " + (data["시간"] - 1).astype(str) + ":00:00"
# data["date"] = data["연월일"] + " " + data["시간"].astype(str) + ":00:00"

In [174]:
data.head(3)

          연월일  시간 구분       공급량                  일시
0  2013-01-01   1  A  2497.129  2013-01-01 0:00:00
1  2013-01-01   2  A  2363.265  2013-01-01 1:00:00
2  2013-01-01   3  A  2258.505  2013-01-01 2:00:00

In [175]:
data["일시"] = pd.to_datetime(data["일시"])

In [176]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 368088 entries, 0 to 368087
Data columns (total 5 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   연월일     368088 non-null  object
 1   시간      368088 non-null  int64
 2   구분      368088 non-null  object
 3   공급량     368088 non-null  float64
 4   일시      368088 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 14.0+ MB

In [177]:
data["year"] = data["일시"].dt.year
data["month"] = data["일시"].dt.month
data["day"] = data["일시"].dt.day

In [178]:
data = data[["연월일", "시간", "일시", "year", "month", "day", "구분", "공급량"]]
data.head(3)

          연월일  시간                  일시  year  month  day 구분       공급량
0  2013-01-01   1 2013-01-01 00:00:00  2013      1    1  A  2497.129
1  2013-01-01   2 2013-01-01 01:00:00  2013      1    1  A  2363.265
2  2013-01-01   3 2013-01-01 02:00:00  2013      1    1  A  2258.505

In [179]:
data.to_csv("../CSV/가스공급량.csv", index = False)

### 기상 데이터

In [181]:
seoul = pd.read_csv("../CSV/서울 기상 데이터/13_서울.csv", encoding = 'cp949')

In [185]:
seoul.head(3)

,지점,지점명,일시,기온(°C),기온 QC플래그,강수량(mm),강수량 QC플래그,풍속(m/s),풍속 QC플래그,풍향(16방위),풍향 QC플래그,습도(%),습도 QC플래그,증기압(hPa),이슬점온도(°C),현지기압(hPa),현지기압 QC플래그,해면기압(hPa),해면기압 QC플래그,일조(hr),일조 QC플래그,일사(MJ/m2),일사 QC플래그,적설(cm),3시간신적설(cm),전운량(10분위),중하층운량(10분위),운형(운형약어),최저운고(100m ),시정(10m),지면상태(지면상태코드),현상번호(국내식),지면온도(°C),지면온도 QC플래그,5cm 지중온도(°C),10cm 지중온도(°C),20cm 지중온도(°C),30cm 지중온도(°C)
0,108,서울,2013-01-01 01:00,-8.5,0,NaN,NaN,4.0,0,50,0,57.0,0,1.8,-15.5,1010.0,0,1021.2,0,NaN,9,NaN,9,6.4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-3.4,0,-2.9,-1.6,-0.5,0.3
1,108,서울,2013-01-01 02:00,-8.4,0,NaN,NaN,4.0,0,70,0,60.0,0,2.0,-14.7,1009.4,0,1020.6,0,NaN,9,NaN,9,6.4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-3.4,0,-3.0,-1.6,-0.5,0.4
2,108,서울,2013-01-01 03:00,-8.1,0,NaN,NaN,3.4,0,70,0,58.0,0,1.9,-14.9,1009.2,0,1020.4,0,NaN,9,NaN,9,6.4,NaN,6.0,6.0,Ac,35.0,2000.0,13.0,NaN,-3.4,0,-3.0,-1.6,-0.5,0.3

In [ ]:
gn.loc[gn["기온(°C)"].isnull(), "기온(°C)"]
# gn.loc[1805 : 1809, ["일시", "기온(°C)"]]
# gn.loc[8830 : 8837, ["일시", "기온(°C)"]]